k6/results/resource-comparison/20260430-222358-small-monitor/scale-out-small/100vu.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/scenarios/07-hot-room-fixed.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 4m0s max duration (incl. graceful stop):
              * hot_room_fixed: 1 iterations for each of 100 VUs (maxDuration: 3m30s, gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m00.6s/3m30s  000/100 iters, 1 per VU

running (0m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m01.6s/3m30s  000/100 iters, 1 per VU

running (0m03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m02.6s/3m30s  000/100 iters, 1 per VU

running (0m04.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m03.6s/3m30s  000/100 iters, 1 per VU

running (0m05.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m04.6s/3m30s  000/100 iters, 1 per VU

running (0m06.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m05.6s/3m30s  000/100 iters, 1 per VU

running (0m07.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m06.6s/3m30s  000/100 iters, 1 per VU

running (0m08.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m07.6s/3m30s  000/100 iters, 1 per VU

running (0m09.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m08.6s/3m30s  000/100 iters, 1 per VU

running (0m10.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m09.6s/3m30s  000/100 iters, 1 per VU

running (0m11.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m10.6s/3m30s  000/100 iters, 1 per VU

running (0m12.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m11.6s/3m30s  000/100 iters, 1 per VU

running (0m13.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m12.6s/3m30s  000/100 iters, 1 per VU

running (0m14.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m13.6s/3m30s  000/100 iters, 1 per VU

running (0m15.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m14.6s/3m30s  000/100 iters, 1 per VU

running (0m16.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m15.6s/3m30s  000/100 iters, 1 per VU

running (0m17.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m16.6s/3m30s  000/100 iters, 1 per VU

running (0m18.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m17.6s/3m30s  000/100 iters, 1 per VU

running (0m19.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m18.6s/3m30s  000/100 iters, 1 per VU

running (0m20.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m19.6s/3m30s  000/100 iters, 1 per VU

running (0m21.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m20.6s/3m30s  000/100 iters, 1 per VU

running (0m22.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m21.6s/3m30s  000/100 iters, 1 per VU

running (0m23.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m22.6s/3m30s  000/100 iters, 1 per VU

running (0m24.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m23.6s/3m30s  000/100 iters, 1 per VU

running (0m25.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m24.6s/3m30s  000/100 iters, 1 per VU

running (0m26.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m25.6s/3m30s  000/100 iters, 1 per VU

running (0m27.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m26.6s/3m30s  000/100 iters, 1 per VU

running (0m28.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m27.6s/3m30s  000/100 iters, 1 per VU

running (0m29.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m28.6s/3m30s  000/100 iters, 1 per VU

running (0m30.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m29.6s/3m30s  000/100 iters, 1 per VU

running (0m31.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m30.6s/3m30s  000/100 iters, 1 per VU

running (0m32.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m31.6s/3m30s  000/100 iters, 1 per VU

running (0m33.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m32.6s/3m30s  000/100 iters, 1 per VU

running (0m34.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m33.6s/3m30s  000/100 iters, 1 per VU

running (0m35.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m34.6s/3m30s  000/100 iters, 1 per VU

running (0m36.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m35.6s/3m30s  000/100 iters, 1 per VU

running (0m37.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m36.6s/3m30s  000/100 iters, 1 per VU

running (0m38.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m37.6s/3m30s  000/100 iters, 1 per VU

running (0m39.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m38.6s/3m30s  000/100 iters, 1 per VU

running (0m40.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m39.6s/3m30s  000/100 iters, 1 per VU

running (0m41.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m40.6s/3m30s  000/100 iters, 1 per VU

running (0m42.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m41.6s/3m30s  000/100 iters, 1 per VU

running (0m43.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m42.6s/3m30s  000/100 iters, 1 per VU

running (0m44.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m43.6s/3m30s  000/100 iters, 1 per VU

running (0m45.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m44.6s/3m30s  000/100 iters, 1 per VU

running (0m46.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m45.6s/3m30s  000/100 iters, 1 per VU

running (0m47.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m46.6s/3m30s  000/100 iters, 1 per VU

running (0m48.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m47.6s/3m30s  000/100 iters, 1 per VU

running (0m49.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m48.6s/3m30s  000/100 iters, 1 per VU

running (0m50.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m49.6s/3m30s  000/100 iters, 1 per VU

running (0m51.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m50.6s/3m30s  000/100 iters, 1 per VU

running (0m52.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m51.6s/3m30s  000/100 iters, 1 per VU

running (0m53.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m52.6s/3m30s  000/100 iters, 1 per VU

running (0m54.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m53.6s/3m30s  000/100 iters, 1 per VU

running (0m55.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m54.6s/3m30s  000/100 iters, 1 per VU

running (0m56.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m55.6s/3m30s  000/100 iters, 1 per VU

running (0m57.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m56.6s/3m30s  000/100 iters, 1 per VU

running (0m58.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m57.6s/3m30s  000/100 iters, 1 per VU

running (0m59.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m58.6s/3m30s  000/100 iters, 1 per VU

running (1m00.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  0m59.6s/3m30s  000/100 iters, 1 per VU

running (1m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m00.6s/3m30s  000/100 iters, 1 per VU

running (1m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m01.6s/3m30s  000/100 iters, 1 per VU

running (1m03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m02.6s/3m30s  000/100 iters, 1 per VU

running (1m04.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m03.6s/3m30s  000/100 iters, 1 per VU

running (1m05.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m04.6s/3m30s  000/100 iters, 1 per VU

running (1m06.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m05.6s/3m30s  000/100 iters, 1 per VU

running (1m07.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m06.6s/3m30s  000/100 iters, 1 per VU

running (1m08.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m07.6s/3m30s  000/100 iters, 1 per VU

running (1m09.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m08.6s/3m30s  000/100 iters, 1 per VU

running (1m10.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m09.6s/3m30s  000/100 iters, 1 per VU

running (1m11.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m10.6s/3m30s  000/100 iters, 1 per VU

running (1m12.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m11.6s/3m30s  000/100 iters, 1 per VU

running (1m13.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m12.6s/3m30s  000/100 iters, 1 per VU

running (1m14.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m13.6s/3m30s  000/100 iters, 1 per VU

running (1m15.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m14.6s/3m30s  000/100 iters, 1 per VU

running (1m16.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m15.6s/3m30s  000/100 iters, 1 per VU

running (1m17.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m16.6s/3m30s  000/100 iters, 1 per VU

running (1m18.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m17.6s/3m30s  000/100 iters, 1 per VU

running (1m19.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m18.6s/3m30s  000/100 iters, 1 per VU

running (1m20.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m19.6s/3m30s  000/100 iters, 1 per VU

running (1m21.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m20.6s/3m30s  000/100 iters, 1 per VU

running (1m22.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m21.6s/3m30s  000/100 iters, 1 per VU

running (1m23.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m22.6s/3m30s  000/100 iters, 1 per VU

running (1m24.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m23.6s/3m30s  000/100 iters, 1 per VU

running (1m25.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m24.6s/3m30s  000/100 iters, 1 per VU

running (1m26.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m25.6s/3m30s  000/100 iters, 1 per VU

running (1m27.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m26.6s/3m30s  000/100 iters, 1 per VU

running (1m28.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m27.6s/3m30s  000/100 iters, 1 per VU

running (1m29.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m28.6s/3m30s  000/100 iters, 1 per VU

running (1m30.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m29.6s/3m30s  000/100 iters, 1 per VU

running (1m31.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m30.6s/3m30s  000/100 iters, 1 per VU

running (1m32.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m31.6s/3m30s  000/100 iters, 1 per VU

running (1m33.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m32.6s/3m30s  000/100 iters, 1 per VU

running (1m34.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m33.6s/3m30s  000/100 iters, 1 per VU

running (1m35.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m34.6s/3m30s  000/100 iters, 1 per VU

running (1m36.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m35.6s/3m30s  000/100 iters, 1 per VU

running (1m37.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m36.6s/3m30s  000/100 iters, 1 per VU

running (1m38.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m37.6s/3m30s  000/100 iters, 1 per VU

running (1m39.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m38.6s/3m30s  000/100 iters, 1 per VU

running (1m40.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m39.6s/3m30s  000/100 iters, 1 per VU

running (1m41.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m40.6s/3m30s  000/100 iters, 1 per VU

running (1m42.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m41.6s/3m30s  000/100 iters, 1 per VU

running (1m43.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m42.6s/3m30s  000/100 iters, 1 per VU

running (1m44.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m43.6s/3m30s  000/100 iters, 1 per VU

running (1m45.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m44.6s/3m30s  000/100 iters, 1 per VU

running (1m46.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m45.6s/3m30s  000/100 iters, 1 per VU

running (1m47.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m46.6s/3m30s  000/100 iters, 1 per VU

running (1m48.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m47.6s/3m30s  000/100 iters, 1 per VU

running (1m49.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m48.6s/3m30s  000/100 iters, 1 per VU

running (1m50.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m49.6s/3m30s  000/100 iters, 1 per VU

running (1m51.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m50.6s/3m30s  000/100 iters, 1 per VU

running (1m52.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m51.6s/3m30s  000/100 iters, 1 per VU

running (1m53.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m52.6s/3m30s  000/100 iters, 1 per VU

running (1m54.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m53.6s/3m30s  000/100 iters, 1 per VU

running (1m55.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m54.6s/3m30s  000/100 iters, 1 per VU

running (1m56.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m55.6s/3m30s  000/100 iters, 1 per VU

running (1m57.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m56.6s/3m30s  000/100 iters, 1 per VU

running (1m58.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m57.6s/3m30s  000/100 iters, 1 per VU

running (1m59.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m58.6s/3m30s  000/100 iters, 1 per VU

running (2m00.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  1m59.6s/3m30s  000/100 iters, 1 per VU

running (2m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  2m00.6s/3m30s  000/100 iters, 1 per VU

running (2m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
hot_room_fixed   [   0% ] 100 VUs  2m01.6s/3m30s  000/100 iters, 1 per VU

running (2m03.0s), 002/100 VUs, 98 complete and 0 interrupted iterations
hot_room_fixed   [  98% ] 100 VUs  2m02.6s/3m30s  098/100 iters, 1 per VU


  █ THRESHOLDS 

    http_error_rate
    ✓ 'rate<0.01' rate=0.00%

    ws_connect_duration_ms
    ✓ 'p(95)<5000' p(95)=596.04ms
    ✓ 'p(99)<10000' p(99)=599.02ms

    ws_connect_success_rate
    ✓ 'rate>0.99' rate=100.00%

    ws_message_roundtrip_ms
    ✓ 'p(50)<5000' p(50)=19ms
    ✓ 'p(95)<60000' p(95)=495.04ms
    ✓ 'p(99)<120000' p(99)=1.51s


  █ TOTAL RESULTS 

    checks_total.......: 404     3.280703/s
    checks_succeeded...: 100.00% 404 out of 404
    checks_failed......: 0.00%   0 out of 404

    ✓ login status 200
    ✓ login has token
    ✓ createHotRoom status 2xx
    ✓ createHotRoom has id
    ✓ enterRoom ok
    ✓ ws connected

    CUSTOM
    hot_room_broadcast_received_total...: 1191258 9673.67104/s
    hot_room_own_echo_received_total....: 11900   96.634554/s
    hot_room_unique_received_total......: 1191258 9673.67104/s
    http_error_rate.....................: 0.00%   0 out of 202
    rest_create_room_duration_ms........: avg=276.66ms min=276.66ms med=276.66ms max=276.66ms p(90)=276.66ms p(95)=276.66ms
    rest_enter_room_duration_ms.........: avg=1.68s    min=1.1s     med=1.69s    max=2.2s     p(90)=1.99s    p(95)=2.08s   
    rest_login_duration_ms..............: avg=248.35ms min=12.34ms  med=182.26ms max=557.28ms p(90)=462.07ms p(95)=483.83ms

    HTTP
    http_req_duration...................: avg=959.16ms min=12.34ms  med=556.62ms max=2.2s     p(90)=1.9s     p(95)=1.99s   
      { expected_response:true }........: avg=959.16ms min=12.34ms  med=556.62ms max=2.2s     p(90)=1.9s     p(95)=1.99s   
    http_req_failed.....................: 0.00%   0 out of 202
    http_reqs...........................: 202     1.640351/s

    EXECUTION
    iteration_duration..................: avg=2m2s     min=2m2s     med=2m2s     max=2m2s     p(90)=2m2s     p(95)=2m2s    
    iterations..........................: 100     0.812055/s
    vus.................................: 2       min=2          max=100
    vus_max.............................: 100     min=100        max=100

    NETWORK
    data_received.......................: 337 MB  2.7 MB/s
    data_sent...........................: 1.3 MB  11 kB/s

    WEBSOCKET
    ws_connect_duration_ms..............: avg=219.33ms min=6ms      med=179ms    max=601ms    p(90)=501.1ms  p(95)=596.04ms
    ws_connect_success_rate.............: 100.00% 100 out of 100
    ws_connecting.......................: avg=219.22ms min=5.58ms   med=178.74ms max=600.22ms p(90)=500.43ms p(95)=594.6ms 
    ws_message_roundtrip_ms.............: avg=86.92ms  min=4ms      med=19ms     max=2.41s    p(90)=105ms    p(95)=495.04ms
    ws_messages_received_total..........: 1191258 9673.67104/s
    ws_messages_sent_total..............: 11934   96.910653/s
    ws_msgs_received....................: 1191258 9673.67104/s
    ws_msgs_sent........................: 11934   96.910653/s
    ws_session_duration.................: avg=2m0s     min=2m0s     med=2m0s     max=2m0s     p(90)=2m0s     p(95)=2m0s    
    ws_sessions.........................: 100     0.812055/s



running (2m03.1s), 000/100 VUs, 100 complete and 0 interrupted iterations
hot_room_fixed ✓ [ 100% ] 100 VUs  2m02.8s/3m30s  100/100 iters, 1 per VU